Revit 2027 API
ElementTypeDuplicatedEventArgs.NewElementTypeId Property
 The id of the newly duplicated ElementType.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId NewElementTypeId { get; }
Public ReadOnly Property NewElementTypeId As ElementId
	Get
public:
property ElementId^ NewElementTypeId {
	ElementId^ get ();
}
member NewElementTypeId : ElementId with get
Property Value
ElementId
See Also
Reference
ElementTypeDuplicatedEventArgs Class
Autodesk.Revit.DB.Events Namespace